In [117]:
import pandas as pd

datas = [15, 12.5, 'Ksb', 22, 'Jim']
ps = pd.Series(datas)
ps

0      15
1    12.5
2     Ksb
3      22
4     Jim
dtype: object

In [118]:
import pandas as pd
datas = (15, 12.5, 'Ksb', 22, 'Jim')
ps = pd.Series(datas)
ps

0      15
1    12.5
2     Ksb
3      22
4     Jim
dtype: object

In [119]:
import pandas as pd
import numpy as np

datas = [15, 12.5, 'Ksb', 22, 'Jim']
ndata = np.array(datas)
ps = pd.Series(ndata)
ps

0      15
1    12.5
2     Ksb
3      22
4     Jim
dtype: object

In [120]:
import pandas as pd
import numpy as np

datas = [15, 12.5, 'Ksb', 22, 'Jim']
idx = ['ksb', 'ณิแนน', 'Tim', 'Jan', 'แมว']
ps = pd.Series(datas, index=idx)
ps

ksb        15
ณิแนน    12.5
Tim       Ksb
Jan        22
แมว       Jim
dtype: object

In [121]:
import pandas as pd
import numpy as np

datas = [15, 12.5, 'Ksb', 22, 'Jim']
idx = ['ksb', 'ณิแนน', 'Tim', 'Jan', 'แมว']
ps = pd.Series(np.array(datas), index=idx)
ps

ksb        15
ณิแนน    12.5
Tim       Ksb
Jan        22
แมว       Jim
dtype: object

In [122]:
data = {'ksb':15, "ณิแนน":12.5, 'Tim':18, 'Jan':22}
ps =pd.Series(data)
ps

ksb      15.0
ณิแนน    12.5
Tim      18.0
Jan      22.0
dtype: float64

In [123]:
data = {'ksb':15, "ณิแนน":12.5, 'Tim':18, 'Jan':22}
ps =pd.Series(data)
ps["ณิแนน"]

12.5

In [124]:
import pandas as pd
datas = [25, 22, 25, 35, 32]
df = pd.DataFrame(datas)
df

    0
0  25
1  22
2  25
3  35
4  32

In [125]:
import pandas as pd
datas = [25, 22, 25, 35, 32]
cols = ['Age']
rows = ['A', 'B', 'C', 'D', 'E']
df = pd.DataFrame(datas, index=rows, columns=cols)
df

   Age
A   25
B   22
C   25
D   35
E   32

In [126]:
import pandas as pd
datas = [[163, 37, 1],
         [175, 20, 0],
         [162, 27, 0],
         [150, 10, 1]]
    
colms = ['height', 'hair_length', 'voice_pitch']
rows =  ['A','B','C','D']
df = pd.DataFrame(datas, index=rows, columns=colms)
df

   height  hair_length  voice_pitch
A     163           37            1
B     175           20            0
C     162           27            0
D     150           10            1

In [127]:
import pandas as pd
lst1 = [15,22,30,24]
lst2 = [20,18,38,19]
datas = list(zip(lst1,lst2))

colms = ['Age','Score']
rows  = ['A','B','C','D']
df = pd.DataFrame(datas, index=rows, columns=colms) 
df

   Age  Score
A   15     20
B   22     18
C   30     38
D   24     19

In [128]:
import pandas as pd
datas =[['Kobkit',25,35],['ณิแนน',22,26],['จอห์น',25,32],['Tim',35,29],['Steal',32,27]]
cols = ['Name','Age','Score']
df = pd.DataFrame(datas, columns=cols)
df

     Name  Age  Score
0  Kobkit   25     35
1   ณิแนน   22     26
2   จอห์น   25     32
3     Tim   35     29
4   Steal   32     27

In [129]:
import pandas as pd
datas =[['Kobkit',25,35],['ณิแนน',22,26],['จอห์น',25,32],['Tim',35,29],['Steal',32,27]]
cols = ['Name','Age','Score']
df = pd.DataFrame(datas, columns=cols)
df.set_index(['Name'], inplace=True)
df

        Age  Score
Name
Kobkit   25     35
ณิแนน    22     26
จอห์น    25     32
Tim      35     29
Steal    32     27

In [130]:
import pandas as pd
datas = [{'Name':'Kobkit','Age':25,'Score':25},{'Name':'ณิแนน','Age':22,'Score':26},{'Name':'จอห์น','Age':25,'Score':32},
         {'Name':'Tim','Age':35,'Score':29},{'Name':'Steal','Age':32,'Score':27}]
df = pd.DataFrame(datas)
df

     Name  Age  Score
0  Kobkit   25     25
1   ณิแนน   22     26
2   จอห์น   25     32
3     Tim   35     29
4   Steal   32     27

In [131]:
import pandas as pd
datas = [{'Name':'Kobkit','Age':25,'Score':25},{'Name':'ณิแนน','Age':22,'Score':26},{'Name':'จอห์น','Age':25,'Score':32},
         {'Name':'Tim','Age':35,'Score':29},{'Name':'Steal','Age':32,'Score':27}]
df = pd.DataFrame(datas)
df.set_index('Name', inplace=True)
df

        Age  Score
Name
Kobkit   25     25
ณิแนน    22     26
จอห์น    25     32
Tim      35     29
Steal    32     27

In [132]:
import pandas as pd
names = ['Kobkit','ณิแนน','จอห์น','Tim','Steal']
ages = [25,22,25,35,32]
scores = [35,26,32,29,27]
cols = ['Name','Age','Score']

name_series = pd.Series(names)
age_series = pd.Series(ages)
score_series = pd.Series(scores)

frame = {'Name':name_series,'Age':age_series,'Score':score_series}
df = pd.DataFrame(frame)
df.set_index('Name', inplace=True)
df

        Age  Score
Name
Kobkit   25     35
ณิแนน    22     26
จอห์น    25     32
Tim      35     29
Steal    32     27

In [133]:
filepath = 'Myfilenew04.xlsx'
writer = pd.ExcelWriter(filepath)
df.to_excel(writer, 'MySheet1', index=True)
writer.save()

In [141]:
import pandas as pd
names = ['Kobkit','ณิแนน','จอห์น','Tim','Steal']
ages = [25,22,25,35,32]
scores = [35,26,32,29,27]
cols = ['Name','Age','Score']

name_series = pd.Series(names)
age_series = pd.Series(ages)
score_series = pd.Series(scores)

df = name_series.to_frame()
df = name_series.to_frame(name='StudentName')
df.set_index('StudentName', inplace=True)
df

Empty DataFrame
Columns: []
Index: [Kobkit, ณิแนน, จอห์น, Tim, Steal]